[
  {
    "employer": "ProRank",
    "role": "Design Engineer, Angular Developer",
    "stack": "Front-End: Angular 16 & 17, Middleware: Node.js & Express.js, Back-End:  Oracle DB & Node-Oracle ORM",
    "description": "ProRank is a startup seeking to transform talent acquisition in healthcare. In September 2023, I started at ProRank as the sole Angular Developer on the team. I was accountable for implementing front-end features and enhancements with Angular 16. As time progressed, I eagerly assumed responsibility for UX and UI design and front-end developer mentorship. I was a key voice in the ideation discussions behind MVP and I brought these discussions to fruition in wireframes and high-fidelity mockups. Once the designs were approved, I tackled the Angular development required to bring them to life in the product. My design and engineering efforts during MVP established ProRank’s new look and the direction of the product, which led to the signing of ProRank’s first client.",
    "workExamples": [
      {
        "id": 1,
        "title": "Year in Review",
        "description": "This is a presentation I put together explaining the highlights of my design and engineering work during my year at ProRank.",
        "link": "assets/images/my-work/prorank/kw-pr-year-in-review.pdf",
        "imgSrc": "assets/images/my-work/prorank/yearInReview.jpg",
        "imgAltTxt": "The cover of the Year In Review presentation I created to showcase my achievements at ProRank."
      },
      {
        "id": 2,
        "title": "UX Docs",
        "description": "UX Docs is a compilation of letter-sized Figma frames that I put together in hopes of providing a simple, yet helpful resource for all things user interface. It details the color palette, font sizes, font colors, and even the CSS required for common UI Elements.",
        "link": "assets/images/my-work/prorank/ux-docs.pdf",
        "imgSrc": "assets/images/my-work/prorank/ux-docs-card-img.png",
        "imgAltTxt": "The color palette, fonts, and CSS pages inside UX Docs"
      },
      {
        "id": 3,
        "title": "ProRank UI Library",
        "description": "ProRank UI Library is the design system I created from scratch in Figma. It consists of 194 components that can be quickly imported into any Figma file, vigorously organized with proper names and plenty of color coding. It serves as the central location where developers, and anyone at ProRank, can locate colors, typography and every UI component in the product.",
        "imgAltTxt": "Screenshots of ProRank UI Library, displaying the various frames dedicated to specific UI components.",
        "carouselImgs": [
          {
            "imgSrc": "assets/images/my-work/prorank/prorank-ui-library.png",
            "imgAlt": "All frames"
          },
          {
            "imgSrc": "assets/images/my-work/prorank/pr-ui-library-cards.png",
            "imgAlt": "Cards frame"
          },
          {
            "imgSrc": "assets/images/my-work/prorank/pr-ui-library-candidate-card.png",
            "imgAlt": "Candidate card (talent search) frame"
          },
          {
            "imgSrc": "assets/images/my-work/prorank/pr-ui-library-talent-communities-cards.png",
            "imgAlt": "Candidate card (talent communities) frame"
          },
          {
            "imgSrc": "assets/images/my-work/prorank/pr-ui-library-buttons-1.png",
            "imgAlt": "Buttons frame 1"
          },
          {
            "imgSrc": "assets/images/my-work/prorank/pr-ui-library-buttons-2.png",
            "imgAlt": "Buttons frame 2"
          },
          {
            "imgSrc": "assets/images/my-work/prorank/pr-ui-library-chips.png",
            "imgAlt": "Chips frame"
          },
          {
            "imgSrc": "assets/images/my-work/prorank/pr-ui-library-flags.png",
            "imgAlt": "Flags frame"
          },
          {
            "imgSrc": "assets/images/my-work/prorank/pr-ui-library-icons-1.png",
            "imgAlt": "Icons frame 1"
          },
          {
            "imgSrc": "assets/images/my-work/prorank/pr-ui-library-icons-2.png",
            "imgAlt": "Icons frame 2"
          },
          {
            "imgSrc": "assets/images/my-work/prorank/pr-ui-library-icons-3.png",
            "imgAlt": "Icons frame 3"
          },
          {
            "imgSrc": "assets/images/my-work/prorank/pr-ui-library-inputs-1.png",
            "imgAlt": "Inputs frame 1"
          },
          {
            "imgSrc": "assets/images/my-work/prorank/pr-ui-library-inputs-2.png",
            "imgAlt": "Inputs frame 2"
          },
          {
            "imgSrc": "assets/images/my-work/prorank/pr-ui-library-base-ui.png",
            "imgAlt": "Base UI frame"
          }
        ]
      }
    ]
  },

  {
    "employer": "Genesys",
    "role": "Software Engineer, Analytics UI",
    "stack": "Front-End: Ember 4 & 5",
    "description": "Genesys develops call center and customer service software, driven by empathy. The Analytics UI team builds and maintains a series of views in which call center managers review various analytics and charts that relay the productivity of their agents. From spring 2022 to fall 2023, I was a software engineer on the Analytics UI team, tasked with implementing new views and features with Ember.js and TypeScript. Prior to opening a pull request, I was required to write integration and unit tests for the code I added, utilizing Ember’s built-in testing functionality and QUnit.",
    "workExamples": [
      {
        "id": 1,
        "title": "Export View Data",
        "description": "A feature I developed with Ember & TypeScript that exports the data from selected views and selected columns inside Analytics UI as a CSV file or PDF. This file is sent to the user's inbox inside Genesys Cloud.",
        "link": "https://help.mypurecloud.com/articles/export-view-data/",
        "img": "assets/images/my-work/genesys/export-view-data.png",
        "imgAltTxt": "Icon of a text document"
      },
      {
        "id": 2,
        "title": "Conversation Data Model",
        "description": "An epic I contributed to in which analytics metrics were applied to conversation records.",
        "link": "https://developer.genesys.cloud/analyticsdatamanagement/analytics/detail/conversation-data-model",
        "img": "assets/images/my-work/genesys/conversation-record.png",
        "imgAltTxt": "Icon of a call center agent wearing a headset"
      },
      {
        "id": 3,
        "title": "Queue Performance Summary & Detail",
        "description": "Two new views I developed with Ember & TypeScript in Analytics UI where the user can see current and past metrics and data for queues.",
        "link": "https://help.mypurecloud.com/articles/queues-performance-summary-view/",
        "link2": "https://help.mypurecloud.com/articles/queue-performance-detail-view/",
        "img": "assets/images/my-work/genesys/queue-performance.png",
        "imgAltTxt": "Icon of a line chart"
      }
    ]
  },

  {
    "employer": "TCC Solutions",
    "role": "UI/UX Developer",
    "stack": "Front-End: Angular 6 & 14, Back-End: ASP.NET Core, C#, Database: Microsoft SQL Server",
    "description": "TCC is a leader in the early childhood education and care solutions industry, developing solutions that help organizations in the industry solve problems to better serve children and families. From 2020-2022, I was the sole UI/UX Developer on the team and my time was spread across multiple projects (highlighted below).",
    "workExamples": [
      {
        "id": 1,
        "title": "GoGoMeds",
        "description": "GoGoMeds is an online pharmacy laser-focused on leveraging technology to make prescription medicine low-cost and stress free. In 2020, GoGoMeds underwent a redesign and it was my responsibility to update Angular components to reflect the mockups provided to me. From 2020-2022, I continuously audited the user interface, focusing on the user experience, the presentation of the UI, mobile performance, and adherence to Section 508/WCAG guidelines. From 2021-2022, I took the lead on redesigning the GoGoMeds portal in Adobe XD and converting the front-end to Angular 14 in a new repository.",
        "link": "https://www.gogomeds.com/",
        "linkTxt": "gogomeds.com",
        "img": "assets/images/my-work/tcc/ggm.png",
        "imgAltTxt": "Screenshot of gogomeds.com, circa 2022"
      },
      {
        "id": 2,
        "title": "NJCCIS",
        "description": "NJCCIS is a government-run organization for families in New Jersey seeking childcare. In 2022, I was responsible for implementing full-stack features with Angular 6, ASP.NET Core, C#, and Microsoft SQL Server. Additionally, I resolved bugs across the stack and frequently analyzed the user interface to detect hindrances to the user experience, front-end defects,  and any breaches of Section 508/WCAG guidelines.",
        "link": "https://www.njccis.com/",
        "linkTxt": "njccis.com",
        "img": "assets/images/my-work/tcc/njccis.png",
        "imgAltTxt": "Screenshot of njccis.com, circa 2022"
      },
      {
        "id": 3,
        "title": "Meck Pre-K",
        "description": "Meck Pre-K is a Pre-Kindergarten Program for families in North Carolina. In 2020, I was responsible for coding the layout and design of new features with Angular 6 and PrimeNG. As part of the code review process, I tested the pull request by running the code in different browsers and different screen sizes, taking note of any defects. Then, I ran the code through a series of Section 508/WCAG tests. After my initial review, I presented my findings to the designated software engineer, who would address them. Upon resolution, I approved the code for deployment to ST for quality assurance.",
        "link": "https://ascend.meckprek.com/ecds/home",
        "linkTxt": "ascend.meckprek.com",
        "img": "assets/images/my-work/tcc/meck.png",
        "imgAltTxt": "Screenshot of meckprek.com, circa 2022"
      },
      {
        "id": 4,
        "title": "TCC Company Website",
        "description": " In addition to client projects, one of my responsibilities was maintaining TCC’s website by adding or removing content as needed through ASP.NET Razor Pages. In 2021, I implemented the Secure Virtual Desktop page (now deprecated) based on a provided mockup.",
        "link": "https://www.e-tcc.com/",
        "linkTxt": "e-tcc.com",
        "img": "assets/images/my-work/tcc/tcc.png",
        "imgAltTxt": "Screenshot of e-tcc.com, Secure Virtual Desktop page, circa 2022"
      }
    ]
  }
]
