[
  {
    "employer": "ProRank",
    "role": "Design Engineer",
    "description": "ProRank is a startup seeking to transform talent acquisition in healthcare. I joined as Angular Developer, developing front-end features and enhancements, but as time progressed, I assumed responsibility for UX and UI design and front-end developer mentorship in addition to angular development. I was a key voice in the ideation discussions behind MVP and I brought these discussions to fruition in wireframes and hi-fidelity mockups. Once the designs were approved, I tackled the angular development required to bring them to life in the product. These efforts established ProRank’s new look and the direction of the product, which led to the signing of ProRank’s first client.",
    "workExamples": [
      {
        "id": 1,
        "title": "Year in Review",
        "description": "This is a presentation I put together explaining the highlights of my design and engineering work during my year at ProRank.",
        "link": "assets/102824_KaylieWoods_ProRank Highlights.pdf",
        "imgSrc": "assets/yearInReview.jpg"
      },
      {
        "id": 2,
        "title": "UX Docs",
        "description": "UX Docs is a compilation of letter-sized Figma frames that I put together in hopes of providing a simple, yet helpful resource for all things user interface. It details the color palette, font sizes, font colors, and even the CSS required for common UI Elements.",
        "link": "assets/UX Docs.pdf",
        "imgSrc": "assets/ux-docs-card-img.png"
      },
      {
        "id": 3,
        "title": "ProRank UI Library",
        "description": "ProRank UI Library is the design system I created from scratch in Figma. It consists of 194 components that can be quickly imported into any Figma file, vigorously organized with proper names and plenty of color coding. It serves as the central location where developers, and anyone at ProRank, can locate colors, typography and every UI component in the product."
      }
    ]
  },

  {
    "employer": "Genesys",
    "role": "Software Engineer, Analytics UI",
    "description": "Genesys Cloud develops call center and customer service software, driven by empathy. The Analytics UI team develops views where managers can go and see various analytics and graphics that relay call center agent productivity. I was a software engineer responsible for developing new views and features for Analytics UI.",
    "workExamples": [
      {
        "id": 1,
        "title": "Export View Data",
        "description": "A feature I developed with Ember & TypeScript that exports the data from selected views and selected columns inside Analytics UI as a CSV file or PDF. This file is sent to the user's inbox inside Genesys Cloud.",
        "link": "https://help.mypurecloud.com/articles/export-view-data/",
        "img": "assets/Export View Data.png",
        "imgAltTxt": "Icon of a text document"
      },
      {
        "id": 2,
        "title": "Conversation Data Model",
        "description": "An epic I comtributed to in which analytics metrics were applied to conversation records.",
        "link": "https://developer.genesys.cloud/analyticsdatamanagement/analytics/detail/conversation-data-model",
        "img": "assets/Conversation Record.png",
        "imgAltTxt": "Icon of a call center agent wearing a headset"
      },
      {
        "id": 3,
        "title": "Queue Performance Summary & Detail",
        "description": "Two new views I developed with Ember & TypeScript in Analytics UI where the user can see current and past metrics and data for queues.",
        "link": "https://help.mypurecloud.com/articles/queues-performance-summary-view/",
        "link2": "https://help.mypurecloud.com/articles/queue-performance-detail-view/",
        "img": "assets/Queue Performance.png",
        "imgAltTxt": "Icon of a line chart"
      }
    ]
  },

  {
    "employer": "TCC Solutions",
    "role": "UI/UX Developer",
    "description": "TCC is a leader in the early childhood education and care solutions industry, developing solutions that help organizations in the industry solve problems to better serve children and families. From 2020-2022, I was the sole UI/UX Developer on the team and my time was spread across multiple projects (highlighted below).",
    "workExamples": [
      {
        "id": 1,
        "title": "GoGoMeds",
        "description": "As the UI/UX Developer on the GoGoMeds team at TCC Solutions, I was responsible for the HTML & CSS of new pages and features. I also resolved front-end bugs, updated content, and audited pages for Section 508 compliance and responsiveness to screen size. I led the design effort and client-side code for rebuilding the client in a blank-slate repository.",
        "link": "https://www.gogomeds.com/",
        "linkTxt": "gogomeds.com",
        "img": "assets/ggm.png",
        "imgAltTxt": "Screenshot of gogomeds.com, circa 2022"
      },
      {
        "id": 2,
        "title": "NJCCIS",
        "description": "When I first joined the NJCCIS team at TCC Solutions, I served as UI/UX Developer, auditing code for any user experience, screen size or accessibility discrepancies. I expressed interest in learning the back-end and tackling full-stack tasks. The team architect helped me get going with C# and SQL. Shortly after, I was tackling full-stack features sprint-to-sprint.",
        "link": "https://www.njccis.com/",
        "linkTxt": "njccis.com",
        "img": "assets/njccis.png",
        "imgAltTxt": "Screenshot of njccis.com, circa 2022"
      },
      {
        "id": 3,
        "title": "Meck Pre-K",
        "description": "As the UI/UX Developer on the Meck Pre-K team at TCC Solutions, I was responsible for the HTML and CSS of new features. Additionally, I reviewed pull requests to ensure usability, Section 508 compliance, responsiveness to screen size, and consistency with the style guide.",
        "link": "https://ascend.meckprek.com/ecds/home",
        "linkTxt": "ascend.meckprek.com",
        "img": "assets/meck.png",
        "imgAltTxt": "Screenshot of meckprek.com, circa 2022"
      },
      {
        "id": 4,
        "title": "TCC Company Website",
        "description": "I was the developer at TCC Software Solutions in charge of any changes needed to the company website. This included coding the Secure Virtual Desktop page in ASP.Net Razor Pages based off a provided wireframe and implementing content updates. Secure Virtual Desktop, and the iteration of e-tcc.com that I worked on, is now deprecated.",
        "link": "https://www.e-tcc.com/",
        "linkTxt": "e-tcc.com",
        "img": "assets/tcc.png",
        "imgAltTxt": "Screenshot of e-tcc.com, Secure Virtual Desktop page, circa 2022"
      }
    ]
  }
]
