[
  {
    "employer": "GEOH",
    "role": "Software Engineer, Full-Stack",
    "stack": "Stack: React 18 •  Node.js & Express.js • Apollo GraphQL • Azure Cosmos DB",
    "description": "GEOH offers billing services and a web + mobile application to home health & home care agencies. In March 2025, I joined the engineering team to assist with the backlog of client feature requests. When June hit, the team shifted priorities to go all-in on implementing support for home health services, which is a longstanding goal for GEOH. This was a gargantuan effort on a tight timeline, but we met the deadline with minimal bugs and disasters. In addition to constructing new pages, features and functionality, I work closely with Tier II support to investigate client issues and with UX Designers to ensure their research and designs are accurately reflected in the UI. I write custom scripts as needed to assist GEOH employees and research potential tools for our codebase to address needs. ",
    "workExamples": [
      {
        "id": 1,
        "title": "Skilled Care - Client Facesheet",
        "description": "Client Facesheet is a designated page where caregivers and providers can access pertinent information about a specific client they serve. I was one of two engineers assigned to this epic, handling the Facesheet, Client Info, Forms, Care Plans, and Notes tabs, along with their associated overlays. This epic introduced entirely new functionality and data, requiring custom hooks and components in addition to new GraphQL schemas, queries, and resolvers.",
        "imgSrc": "assets/images/my-work/geoh/GeohPinBkgd.webp",
        "imgAltText": "Geoh logo"
      },
      {
        "id": 2,
        "title": "Skilled Care - Visit Facesheet",
        "description": "Visit Facesheet is a designated page where caregivers and providers log their visits. Visit Facesheet closely mirrors Client Facesheet and the two share some data and components. After I polished Client Facesheet, I updated the components and behaviors associated with Visit Facesheet to either repurpose Client Facesheet’s components, styles and logic or to follow the patterns outlined by Client Facesheet. I took control of addressing missed requirements, ensuring performance on mobile, and collaborating with UX Designers to fine tune the UI.",
        "imgSrc": "assets/images/my-work/geoh/GeohPinBkgd.webp",
        "imgAltText": "GEOH logo"
      },
      {
        "id": 3,
        "title": "Client Tasklist",
        "description": "Client Tasklist provides a central location for agency owners to view and take action on tasks related to their clients. I was responsible for the reminder column and its associated overlays. The reminder column presents a button per client that either opens an overlay for the user to input required information or routes the user to the designated form. There are 5 steps in the flow for the reminder column, each triggered by a specific event. This required me to build a new component for the create task overlay and a formatter for the button to determine its text and action. Additionally, I had to configure the upsert to accept reminderId.",
        "imgSrc": "assets/images/my-work/geoh/ClientTasklist.png",
        "imgAltText": "Client Tasklist, GEOH"
      },
      {
        "id": 4,
        "title": "Employee Tasklist",
        "description": "Employee Tasklist provides a central location for agency owners to view and take action on tasks related to their employees. I was responsible for building the create task overlay where an agency owner can assign a task to an employee and the employee credentials overlay where required documents can be uploaded to an employee’s record. This required two new components and behaviors to support them. ",
        "imgSrc": "assets/images/my-work/geoh/EmployeeTasklist.png",
        "imgAltText": "Client Tasklist, GEOH"
      },
      {
        "id": 5,
        "title": "Multi-Line Scheduler",
        "description": "Home health and home care agencies depend on a reliable, detailed scheduling calendar to ensure patient needs are addressed. It became clear that our pre-existing scheduler needed some enhancements to meet our clients’ needs. I implemented the infrastructure for a new page where a specific employee’s recurring visits and calendar are displayed and can be edited by agency managers. Afterwards, I constructed the calendar and its associated overlays. This required new components for the new overlays, a new behavior for the calendar, and configuring the pre-existing calendar component to meet the needs of this new use case without affecting other pages.",
        "imgSrc": "assets/images/my-work/geoh/MultiLineScheduler.png"
      },
      {
        "id": 6,
        "title": "Performance Metrics",
        "description": "Performance Metrics presents charts relaying the performance of the user’s agency. I was tasked with developing the controls a user can interact with to apply aggregates to the metrics displayed. When close to completion, I adjusted the JSX and JSS to ensure performance metrics is usable and presentable on mobile.",
        "imgSrc": "assets/images/my-work/geoh/PerformanceMetrics.png"
      }
    ]
  },
  {
    "employer": "ProRank",
    "role": "Design Engineer, Angular Developer",
    "stack": "Stack: Angular 16 & 17  •  Node.js + Express.js  •  Oracle DB & Node-Oracle ORM",
    "description": "ProRank is a startup seeking to transform talent acquisition in healthcare. In September 2023, I started at ProRank as the sole Angular Developer on the team. I was accountable for implementing front-end features and enhancements with Angular 16. As time progressed, I eagerly assumed responsibility for UX and UI design and front-end developer mentorship. I was a key voice in the ideation discussions behind MVP and I brought these discussions to fruition in wireframes and high-fidelity mockups. Once the designs were approved, I tackled the Angular development required to bring them to life in the product. My design and engineering efforts during MVP established ProRank’s new look and the direction of the product, which led to the signing of ProRank’s first client.",
    "workExamples": [
      {
        "id": 1,
        "title": "Year in Review",
        "description": "This is a presentation I put together explaining the highlights of my design and engineering work during my year at ProRank.",
        "link": "assets/images/my-work/prorank/kw-pr-year-in-review.pdf",
        "imgSrc": "assets/images/my-work/prorank/yearInReview.jpg",
        "imgAltTxt": "The cover of the Year In Review presentation I created to showcase my achievements at ProRank."
      },
      {
        "id": 2,
        "title": "UX Docs",
        "description": "UX Docs is a compilation of letter-sized Figma frames that I put together in hopes of providing a simple, yet helpful resource for all things user interface. It details the color palette, font sizes, font colors, and even the CSS required for common UI Elements.",
        "link": "assets/images/my-work/prorank/ux-docs.pdf",
        "imgSrc": "assets/images/my-work/prorank/ux-docs-card-img.png",
        "imgAltTxt": "The color palette, fonts, and CSS pages inside UX Docs"
      },
      {
        "id": 3,
        "title": "ProRank UI Library",
        "description": "ProRank UI Library is the design system I created from scratch in Figma. It consists of 194 components that can be quickly imported into any Figma file, vigorously organized with proper names and plenty of color coding. It serves as the central location where developers, and anyone at ProRank, can locate colors, typography and every UI component in the product.",
        "imgAltTxt": "Screenshots of ProRank UI Library, displaying the various frames dedicated to specific UI components.",
        "carouselImgs": [
          {
            "imgSrc": "assets/images/my-work/prorank/prorank-ui-library.png",
            "imgAlt": "All frames"
          },
          {
            "imgSrc": "assets/images/my-work/prorank/pr-ui-library-cards.png",
            "imgAlt": "Cards frame"
          },
          {
            "imgSrc": "assets/images/my-work/prorank/pr-ui-library-candidate-card.png",
            "imgAlt": "Candidate card (talent search) frame"
          },
          {
            "imgSrc": "assets/images/my-work/prorank/pr-ui-library-talent-communities-cards.png",
            "imgAlt": "Candidate card (talent communities) frame"
          },
          {
            "imgSrc": "assets/images/my-work/prorank/pr-ui-library-buttons-1.png",
            "imgAlt": "Buttons frame 1"
          },
          {
            "imgSrc": "assets/images/my-work/prorank/pr-ui-library-buttons-2.png",
            "imgAlt": "Buttons frame 2"
          },
          {
            "imgSrc": "assets/images/my-work/prorank/pr-ui-library-chips.png",
            "imgAlt": "Chips frame"
          },
          {
            "imgSrc": "assets/images/my-work/prorank/pr-ui-library-flags.png",
            "imgAlt": "Flags frame"
          },
          {
            "imgSrc": "assets/images/my-work/prorank/pr-ui-library-icons-1.png",
            "imgAlt": "Icons frame 1"
          },
          {
            "imgSrc": "assets/images/my-work/prorank/pr-ui-library-icons-2.png",
            "imgAlt": "Icons frame 2"
          },
          {
            "imgSrc": "assets/images/my-work/prorank/pr-ui-library-icons-3.png",
            "imgAlt": "Icons frame 3"
          },
          {
            "imgSrc": "assets/images/my-work/prorank/pr-ui-library-inputs-1.png",
            "imgAlt": "Inputs frame 1"
          },
          {
            "imgSrc": "assets/images/my-work/prorank/pr-ui-library-inputs-2.png",
            "imgAlt": "Inputs frame 2"
          },
          {
            "imgSrc": "assets/images/my-work/prorank/pr-ui-library-base-ui.png",
            "imgAlt": "Base UI frame"
          }
        ]
      }
    ]
  },

  {
    "employer": "Genesys",
    "role": "Software Engineer, Analytics UI",
    "stack": "Stack: Ember 4 & 5  •  TypeScript  •  Ember Testing Suite + QUnit",
    "description": "Genesys builds call center and customer service software, driven by empathy. The Analytics UI team builds and maintains a series of views in which call center managers review various metrics and data visualizations that relay the productivity of their agents. From spring 2022 to fall 2023, I was a software engineer on the Analytics UI team, tasked with implementing new views and features with Ember.js and TypeScript. Prior to opening a pull request, I was required to write integration and unit tests for the code I added, utilizing Ember’s built-in testing functionality and QUnit.",
    "workExamples": [
      {
        "title": "Views",
        "description": "When I was assigned new views to build, I was responsible for the TS, HTML, CSS and integration/unit tests required to establish the view. Each view required the execution of various API requests followed by rigorous TypeScript logic to pass each object and/or property inside the response object to their designated location in the UI. Each view also required custom TypeScript to enable the user to customize the view through the use of filters, sorting, toggles, and column rearrangement.",
        "imgSrc": "assets/images/my-work/genesys/queue_activity_detail_view_new.png",
        "imgAltText": "Queue Activity Detail, Genesys Cloud",
        "examples": [
          {
            "id": 1,
            "title": "Queues Activity Summary & Detail",
            "description": "Parent and child user interfaces that enable call center managers to view and interact with real-time statistics for queues.",
            "link": "https://help.mypurecloud.com/articles/queues-activity-summary-view/",
            "link2": "https://help.mypurecloud.com/articles/queues-activity-detail-view/"
          },
          {
            "id": 2,
            "title": "Queue Performance Summary & Detail",
            "description": "Parent and child user interfaces that display data visualizations relaying metrics and data for queues.",
            "link": "https://help.mypurecloud.com/articles/queues-performance-summary-view/",
            "link2": "https://help.mypurecloud.com/articles/queue-performance-detail-view/"
          },
          {
            "id": 3,
            "title": "Campaign Performance Summary",
            "description": "Parent user interface for Campaign Performance Detail that provides current and past metrics and data for campaigns.",
            "link": "https://help.mypurecloud.com/articles/campaigns-performance-summary-view/"
          }
        ]
      },
      {
        "title": "Features",
        "description": "When I was assigned new features to build, I was responsible for the client-side code and automated testing required to add new functionality to existing views. These tasks typically involved considerable TypeScript logic with additions to the relevant view’s HTML.",
        "imgSrc": "assets/images/my-work/genesys/export-view-data-ui.webp",
        "imgAltText": "Export View Data, Genesys Cloud",
        "examples": [
          {
            "id": 1,
            "title": "Agent Development Learning Modules",
            "description": "Users with the Master or Performance Admin role can automatically or manually assign a learning module to an agent or to a group of agents. Master or Performance Admins can also reset and re-assign learning modules as needed.",
            "link": "https://help.mypurecloud.com/articles/assign-a-development-and-feedback-module/",
            "link2": "https://help.mypurecloud.com/articles/reset-and-assign-a-module-again/"
          },
          {
            "id": 2,
            "title": "Analytics UI Workspace Improvements",
            "description": "All Analytics UI users can save their customized views, which will be located in the Saved list on the Workspace tab. Users can also override an existing saved view and export any view as a CSV file or a PDF report delivered to their inbox in Genesys Cloud.",
            "link": "https://help.mypurecloud.com/articles/work-with-the-analytics-workspace"
          },
          {
            "id": 3,
            "title": "Export View Data",
            "description": "Users with data export permissions are able to export the data from selected views and selected columns inside an Analytics UI view as a CSV file or PDF. This file is sent to the user's inbox inside Genesys Cloud.",
            "link": "https://help.mypurecloud.com/articles/export-view-data/"
          }
        ]
      }
    ]
  },

  {
    "employer": "TCC Solutions",
    "role": "UI/UX Developer",
    "stack": "Stack: Angular 6-14  •  ASP.NET Core, C#  •  Microsoft SQL Server  •  Jasmine + Karma",
    "description": "TCC is a leader in the early childhood education and care solutions industry, developing solutions that help organizations in the industry solve problems to better serve children and families. From 2020-2022, I was the sole UI/UX Developer on the team and my time was spread across multiple projects (highlighted below).",
    "workExamples": [
      {
        "id": 1,
        "title": "GoGoMeds",
        "description": "GoGoMeds is an online pharmacy laser-focused on leveraging technology to make prescription medicine low-cost and stress free. In 2020, GoGoMeds underwent a redesign and it was my responsibility to update Angular components to reflect the mockups provided to me. From 2020-2022, I continuously audited the user interface, focusing on the user experience, the presentation of the UI, mobile performance, and adherence to Section 508/WCAG guidelines. From 2021-2022, I took the lead on redesigning the GoGoMeds portal in Adobe XD and converting the frontend to Angular 14 in a new repository.",
        "link": "https://www.gogomeds.com/",
        "linkTxt": "gogomeds.com",
        "imgSrc": "assets/images/my-work/tcc/ggm.png",
        "imgAltTxt": "Screenshot of gogomeds.com, circa 2022"
      },
      {
        "id": 2,
        "title": "NJCCIS",
        "description": "NJCCIS is a government-run organization for families in New Jersey seeking childcare. In 2022, I was responsible for implementing full-stack features with Angular 6, ASP.NET Core, C#, and Microsoft SQL Server. Additionally, I resolved bugs across the stack and frequently analyzed the user interface to detect hindrances to the user experience, front-end defects, and any breaches of Section 508/WCAG guidelines.",
        "link": "https://www.njccis.com/",
        "linkTxt": "njccis.com",
        "imgSrc": "assets/images/my-work/tcc/njccis.png",
        "imgAltTxt": "Screenshot of njccis.com, circa 2022"
      },
      {
        "id": 3,
        "title": "Meck Pre-K",
        "description": "Meck Pre-K is a Pre-Kindergarten Program for families in North Carolina. In 2020, I was responsible for coding the layout and design of new features with Angular 6 and PrimeNG. Additionally, I contributed to the team’s code review process by running pull requests in different browsers with varying screen sizes. I took note of any defects then ran the code through a series of Section 508/WCAG tests. Upon completion of this process, I presented my findings to the designated software engineer, who would address them prior to deployment.",
        "link": "https://ascend.meckprek.com/ecds/home",
        "linkTxt": "ascend.meckprek.com",
        "imgSrc": "assets/images/my-work/tcc/meck.png",
        "imgAltTxt": "Screenshot of meckprek.com, circa 2022"
      },
      {
        "id": 4,
        "title": "TCC Company Website",
        "description": "In addition to client projects, one of my responsibilities was maintaining TCC’s website by adding or removing content as needed through ASP.NET Razor Pages. In 2021, I implemented the Secure Virtual Desktop page (now deprecated) based on a provided mockup.",
        "link": "https://www.e-tcc.com/",
        "linkTxt": "e-tcc.com",
        "imgSrc": "assets/images/my-work/tcc/tcc.png",
        "imgAltTxt": "Screenshot of e-tcc.com, Secure Virtual Desktop page, circa 2022"
      }
    ]
  }
]
